:- initialization main, halt.

% Inital predicats
ушел(колобок, дед).
ушел(колобок, баба).
ушел(колобок, заяц).
ушел(колобок, волк).
ушел(колобок, медведь).
не_ушел(колобок, лиса).

main :-
  ушел(A, волк), writef("%t ушёл от волка.\n", [A]),
  ушел(C, дед), ушел(C, баба), writef("%t ушёл от деда, и от бабы.\n", [C]),
  не_ушел(B, лиса), writef("%t не ушёл от лисы.\n", [B]),

  findall(X, ушел(колобок, X), Xs),
  findall(Y, не_ушел(колобок, Y), Ys),
  findall(Z, не_ушел(Z, лиса), Zs),

  append(Zs, Xs, Ws),
  append(Ws, Ys, All),

  writef("все персонажи сказки: %t.", [All]).
